KeymanWeb.KR(new Keyboard_osmanya10());

function Keyboard_osmanya10() {
    this.KI = "Keyboard_osmanya10";
    this.KN = "Osmanya (Unicode)";
    this.KV = {
        F: ' 1em "Code2001"',
        K102: 0,
        BK: new Array("`", "𐒡", "𐒢", "𐒣", "𐒤", "𐒥", "𐒦", "𐒧", "𐒨", "𐒩", "𐒠", "-", "=", "", "", "", "𐒎", "𐒓", "𐒗", "𐒇", "𐒂", "𐒕", "𐒚", "𐒘", "𐒙", "", "[", "]", "𐒀", "", "", "", "𐒖", "𐒈", "𐒆", "𐒍", "𐒌", "𐒔", "𐒃", "𐒏", "𐒐", ";", "'", "", "", "", "", "", "\\", "", "𐒄", "𐒋", "", "𐒁", "𐒒", "𐒑", ",", ".", "/", "", "", "", "", "", " ", "~", "!", "@", "#", "$", "%", "^", "&", "*", "(", ")", "_", "+", "", "", "", "𐒎", "𐒓", "𐒗", "𐒇", "𐒂", "𐒕", "𐒚", "𐒘", "𐒙", "", "{", "}", "𐒀", "", "", "", "𐒖", "𐒈", "𐒆", "𐒍", "𐒌", "𐒔", "𐒃", "𐒏", "𐒐", ":", "\"", "", "", "", "", "", "|", "", "𐒄", "𐒋", "", "𐒁", "𐒒", "𐒑", "<", ">", "?", "", "", "", "", "", " ", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "~", "!", "@", "#", "$", "%", "^", "&", "*", "(", ")", "_", "+", "", "", "", "Q", "W", "E", "R", "T", "Y", "U", "I", "O", "P", "{", "}", "|", "", "", "", "A", "S", "D", "F", "G", "H", "J", "K", "L", ":", "\"", "", "", "", "", "", "|", "Z", "X", "C", "V", "B", "N", "M", "<", ">", "?", "", "", "", "", "", " ", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "\\", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "|", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "")
    };
    this.KH = '';
    this.KM = 0;
    this.s9 = "hH";
    this.s10 = "pPzZvV";
    this.s11 = "btjxdrscgfqklmnwhyaeiouBTJXDRSCGFQKLMNWHYAEIOU\\|";
    this.s12 = "𐒁𐒂𐒃𐒄𐒆𐒇𐒈𐒋𐒌𐒍𐒎𐒏𐒐𐒑𐒒𐒓𐒔𐒕𐒖𐒗𐒘𐒙𐒚𐒁𐒂𐒃𐒄𐒆𐒇𐒈𐒋𐒌𐒍𐒎𐒏𐒐𐒑𐒒𐒓𐒔𐒕𐒖𐒗𐒘𐒙𐒚𐒀𐒀";
    this.s13 = "0123456789";
    this.s14 = "𐒠𐒡𐒢𐒣𐒤𐒥𐒦𐒧𐒨𐒩";
    this.gs = function(t, e) {
        return this.g0(t, e);
    };
    this.g0 = function(t, e) {
        var k = KeymanWeb,
            m = 0;
        if (k.KKM(e, 16384, 48)) {
            m = 1;
            k.KO(0, t, "𐒠");
        } else if (k.KKM(e, 16384, 49)) {
            m = 1;
            k.KO(0, t, "𐒡");
        } else if (k.KKM(e, 16384, 50)) {
            m = 1;
            k.KO(0, t, "𐒢");
        } else if (k.KKM(e, 16384, 51)) {
            m = 1;
            k.KO(0, t, "𐒣");
        } else if (k.KKM(e, 16384, 52)) {
            m = 1;
            k.KO(0, t, "𐒤");
        } else if (k.KKM(e, 16384, 53)) {
            m = 1;
            k.KO(0, t, "𐒥");
        } else if (k.KKM(e, 16384, 54)) {
            m = 1;
            k.KO(0, t, "𐒦");
        } else if (k.KKM(e, 16384, 55)) {
            m = 1;
            k.KO(0, t, "𐒧");
        } else if (k.KKM(e, 16384, 56)) {
            m = 1;
            k.KO(0, t, "𐒨");
        } else if (k.KKM(e, 16384, 57)) {
            m = 1;
            k.KO(0, t, "𐒩");
        } else if (k.KKM(e, 16400, 65) && k.KCM(1, t, "𐒖", 1)) {
            m = 1;
            k.KO(1, t, "𐒛");
        } else if (k.KKM(e, 16400, 65)) {
            m = 1;
            k.KO(0, t, "𐒖");
        } else if (k.KKM(e, 16400, 66)) {
            m = 1;
            k.KO(0, t, "𐒁");
        } else if (k.KKM(e, 16400, 67)) {
            m = 1;
            k.KO(0, t, "𐒋");
        } else if (k.KKM(e, 16400, 68)) {
            m = 1;
            k.KO(0, t, "𐒆");
        } else if (k.KKM(e, 16400, 69) && k.KCM(1, t, "𐒗", 1)) {
            m = 1;
            k.KO(1, t, "𐒜");
        } else if (k.KKM(e, 16400, 69)) {
            m = 1;
            k.KO(0, t, "𐒗");
        } else if (k.KKM(e, 16400, 70)) {
            m = 1;
            k.KO(0, t, "𐒍");
        } else if (k.KKM(e, 16400, 71)) {
            m = 1;
            k.KO(0, t, "𐒌");
        } else if (k.KKM(e, 16400, 72) && k.KCM(1, t, "𐒏", 1)) {
            m = 1;
            k.KO(1, t, "𐒅");
        } else if (k.KKM(e, 16400, 72) && k.KCM(1, t, "𐒏", 1)) {
            m = 1;
            k.KO(1, t, "𐒅");
        } else if (k.KKM(e, 16400, 72) && k.KCM(1, t, "𐒈", 1)) {
            m = 1;
            k.KO(1, t, "𐒉");
        } else if (k.KKM(e, 16400, 72) && k.KCM(1, t, "𐒈", 1)) {
            m = 1;
            k.KO(1, t, "𐒉");
        } else if (k.KKM(e, 16400, 72) && k.KCM(1, t, "𐒆", 1)) {
            m = 1;
            k.KO(1, t, "𐒊");
        } else if (k.KKM(e, 16400, 72) && k.KCM(1, t, "𐒆", 1)) {
            m = 1;
            k.KO(1, t, "𐒊");
        } else if (k.KKM(e, 16400, 72)) {
            m = 1;
            k.KO(0, t, "𐒔");
        } else if (k.KKM(e, 16400, 73) && k.KCM(1, t, "𐒘", 1)) {
            m = 1;
            k.KO(1, t, "𐒕");
        } else if (k.KKM(e, 16400, 73)) {
            m = 1;
            k.KO(0, t, "𐒘");
        } else if (k.KKM(e, 16400, 74)) {
            m = 1;
            k.KO(0, t, "𐒃");
        } else if (k.KKM(e, 16400, 75)) {
            m = 1;
            k.KO(0, t, "𐒏");
        } else if (k.KKM(e, 16400, 76)) {
            m = 1;
            k.KO(0, t, "𐒐");
        } else if (k.KKM(e, 16400, 77)) {
            m = 1;
            k.KO(0, t, "𐒑");
        } else if (k.KKM(e, 16400, 78)) {
            m = 1;
            k.KO(0, t, "𐒒");
        } else if (k.KKM(e, 16400, 79) && k.KCM(1, t, "𐒙", 1)) {
            m = 1;
            k.KO(1, t, "𐒝");
        } else if (k.KKM(e, 16400, 79)) {
            m = 1;
            k.KO(0, t, "𐒙");
        } else if (k.KKM(e, 16400, 80)) {
            m = 1;
        } else if (k.KKM(e, 16400, 81)) {
            m = 1;
            k.KO(0, t, "𐒎");
        } else if (k.KKM(e, 16400, 82)) {
            m = 1;
            k.KO(0, t, "𐒇");
        } else if (k.KKM(e, 16400, 83)) {
            m = 1;
            k.KO(0, t, "𐒈");
        } else if (k.KKM(e, 16400, 84)) {
            m = 1;
            k.KO(0, t, "𐒂");
        } else if (k.KKM(e, 16400, 85) && k.KCM(1, t, "𐒚", 1)) {
            m = 1;
            k.KO(1, t, "𐒓");
        } else if (k.KKM(e, 16400, 85)) {
            m = 1;
            k.KO(0, t, "𐒚");
        } else if (k.KKM(e, 16400, 86)) {
            m = 1;
        } else if (k.KKM(e, 16400, 87)) {
            m = 1;
            k.KO(0, t, "𐒓");
        } else if (k.KKM(e, 16400, 88)) {
            m = 1;
            k.KO(0, t, "𐒄");
        } else if (k.KKM(e, 16400, 89)) {
            m = 1;
            k.KO(0, t, "𐒕");
        } else if (k.KKM(e, 16400, 90)) {
            m = 1;
        } else if (k.KKM(e, 16384, 220)) {
            m = 1;
            k.KO(0, t, "𐒀");
        } else if (k.KKM(e, 16384, 65) && k.KCM(1, t, "𐒖", 1)) {
            m = 1;
            k.KO(1, t, "𐒛");
        } else if (k.KKM(e, 16384, 65)) {
            m = 1;
            k.KO(0, t, "𐒖");
        } else if (k.KKM(e, 16384, 66)) {
            m = 1;
            k.KO(0, t, "𐒁");
        } else if (k.KKM(e, 16384, 67)) {
            m = 1;
            k.KO(0, t, "𐒋");
        } else if (k.KKM(e, 16384, 68)) {
            m = 1;
            k.KO(0, t, "𐒆");
        } else if (k.KKM(e, 16384, 69) && k.KCM(1, t, "𐒗", 1)) {
            m = 1;
            k.KO(1, t, "𐒜");
        } else if (k.KKM(e, 16384, 69)) {
            m = 1;
            k.KO(0, t, "𐒗");
        } else if (k.KKM(e, 16384, 70)) {
            m = 1;
            k.KO(0, t, "𐒍");
        } else if (k.KKM(e, 16384, 71)) {
            m = 1;
            k.KO(0, t, "𐒌");
        } else if (k.KKM(e, 16384, 72) && k.KCM(1, t, "𐒏", 1)) {
            m = 1;
            k.KO(1, t, "𐒅");
        } else if (k.KKM(e, 16384, 72) && k.KCM(1, t, "𐒏", 1)) {
            m = 1;
            k.KO(1, t, "𐒅");
        } else if (k.KKM(e, 16384, 72) && k.KCM(1, t, "𐒈", 1)) {
            m = 1;
            k.KO(1, t, "𐒉");
        } else if (k.KKM(e, 16384, 72) && k.KCM(1, t, "𐒈", 1)) {
            m = 1;
            k.KO(1, t, "𐒉");
        } else if (k.KKM(e, 16384, 72) && k.KCM(1, t, "𐒆", 1)) {
            m = 1;
            k.KO(1, t, "𐒊");
        } else if (k.KKM(e, 16384, 72) && k.KCM(1, t, "𐒆", 1)) {
            m = 1;
            k.KO(1, t, "𐒊");
        } else if (k.KKM(e, 16384, 72)) {
            m = 1;
            k.KO(0, t, "𐒔");
        } else if (k.KKM(e, 16384, 73) && k.KCM(1, t, "𐒘", 1)) {
            m = 1;
            k.KO(1, t, "𐒕");
        } else if (k.KKM(e, 16384, 73)) {
            m = 1;
            k.KO(0, t, "𐒘");
        } else if (k.KKM(e, 16384, 74)) {
            m = 1;
            k.KO(0, t, "𐒃");
        } else if (k.KKM(e, 16384, 75)) {
            m = 1;
            k.KO(0, t, "𐒏");
        } else if (k.KKM(e, 16384, 76)) {
            m = 1;
            k.KO(0, t, "𐒐");
        } else if (k.KKM(e, 16384, 77)) {
            m = 1;
            k.KO(0, t, "𐒑");
        } else if (k.KKM(e, 16384, 78)) {
            m = 1;
            k.KO(0, t, "𐒒");
        } else if (k.KKM(e, 16384, 79) && k.KCM(1, t, "𐒙", 1)) {
            m = 1;
            k.KO(1, t, "𐒝");
        } else if (k.KKM(e, 16384, 79)) {
            m = 1;
            k.KO(0, t, "𐒙");
        } else if (k.KKM(e, 16384, 80)) {
            m = 1;
        } else if (k.KKM(e, 16384, 81)) {
            m = 1;
            k.KO(0, t, "𐒎");
        } else if (k.KKM(e, 16384, 82)) {
            m = 1;
            k.KO(0, t, "𐒇");
        } else if (k.KKM(e, 16384, 83)) {
            m = 1;
            k.KO(0, t, "𐒈");
        } else if (k.KKM(e, 16384, 84)) {
            m = 1;
            k.KO(0, t, "𐒂");
        } else if (k.KKM(e, 16384, 85) && k.KCM(1, t, "𐒚", 1)) {
            m = 1;
            k.KO(1, t, "𐒓");
        } else if (k.KKM(e, 16384, 85)) {
            m = 1;
            k.KO(0, t, "𐒚");
        } else if (k.KKM(e, 16384, 86)) {
            m = 1;
        } else if (k.KKM(e, 16384, 87)) {
            m = 1;
            k.KO(0, t, "𐒓");
        } else if (k.KKM(e, 16384, 88)) {
            m = 1;
            k.KO(0, t, "𐒄");
        } else if (k.KKM(e, 16384, 89)) {
            m = 1;
            k.KO(0, t, "𐒕");
        } else if (k.KKM(e, 16384, 90)) {
            m = 1;
        } else if (k.KKM(e, 16400, 220)) {
            m = 1;
            k.KO(0, t, "𐒀");
        } else if (k.KKM(e, 16480, 220)) {
            m = 1;
            k.KO(0, t, "\\");
        } else if (k.KKM(e, 16496, 220)) {
            m = 1;
            k.KO(0, t, "|");
        }
        return m;
    };
}